# Insulation Material Get Insulation Material Id By Name Method

Source: https://www.revitapidocs.com/2026/7edd5fd6-6797-fe17-127f-8528908987e8.htm

---

| Insulation Material Get Insulation Material Id By Name Method |
| --- |

Gets the Conductor Insulation Material id by given Conductor Insulation Material name.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ElementId GetInsulationMaterialIdByName(
	Document document,
	string name
)
```

```
Public Shared Function GetInsulationMaterialIdByName (
	document As Document,
	name As String
) As ElementId
```

```
public:
static ElementId^ GetInsulationMaterialIdByName(
	Document^ document,
	String^ name
)
```

```
static member GetInsulationMaterialIdByName :
        document : Document *
        name : string -> ElementId
```

#### Parameters

document Document
:   The document.

name String
:   The Conductor Insulation Material name.

#### Return Value

ElementId
The Conductor Insulation Material id. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document.  \-or\-  name cannot include prohibited characters, such as "{, }, \[, ], \|, ;, less\-than sign, greater\-than sign, ?, \`, \~".  \-or\-  name is an empty string. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

InsulationMaterial Class Autodesk.Revit.DB.Electrical Namespace